# GetKeyBasedTreeEntriesIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntries..::..GetKeyBasedTreeEntriesIterator Method
KeyBasedTreeEntries Class See Also
---
Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntriesIterator GetKeyBasedTreeEntriesIterator()
```

Visual Basic
---
```text
Public Function GetKeyBasedTreeEntriesIterator As KeyBasedTreeEntriesIterator
```

Visual C++
---
```text
public:
KeyBasedTreeEntriesIterator^ GetKeyBasedTreeEntriesIterator()
```

# ### Return Value
A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.
# See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace